{
  "ac": [
    "AC (Accepted/All Correct/All Clear) means yours solution passed the internal test cases. It is a term for online judge(OJ)."
  ],
  "wa": ["Wrong Answer. It is a term for online judge(OJ)."],
  "tle": ["Time Limit Exceed. It is a term for online judge(OJ)."],
  "mle": ["Memory Limit Exceed. It is a term for online judge(OJ)."],
  "oj": [
    "An online judge is an online system to test programs in programming contests or for practices. Examples include Codeforces, Kattis, UVa, and Leetcode.",
    "https://codeforces.com/blog/entry/93527"
  ],
  "clrs": [
    "Introduction to Algorithms is a book on computer programming. Its fame has led to the common use of the abbreviation \"CLRS\" (Cormen, Leiserson, Rivest, Stein).",
    "https://en.wikipedia.org/wiki/Introduction_to_Algorithms"
  ],
  "faang": [
    "FAANG is an acronym that refers to five prominent American technology companies: Meta (formerly known as Facebook), Amazon, Apple, Netflix and Alphabet (formerly known as Google)."
  ],
  "hft": [
    "High-frequency trading, also known as HFT, is a method of trading that uses powerful computer programs to transact a large number of orders in fractions of a second.",
    "https://www.investopedia.com/terms/h/high-frequency-trading.asp"
  ],
  "rsu": [
    "Restricted Stock Unit",
    "https://www.investopedia.com/terms/r/restricted-stock-unit.asp"
  ],
  "lc": [
    "LC is an acronym for LeetCode, an online judge (OJ) for practicing coding problems and prepare for technical interviews.",
    "https://leetcode.com/"
  ],
  "tc": [
    "TC refers to the total compensation of a job in a year. Total compensation in a tech company typically consists of 3 components: base salary, bonus and stock (or RSU / stock options)."
  ],
  "ic": [
    "IC is an acronym for individual contributor. Individual contributor is one of the two tracks for software engineering career, the other being the management track."
  ],
  "lgtm": [
    "The letters LGTM stand for \"looks good to me.\" Those working in software development often use it after reviewing code."
  ],
  "pr": [
    "PR/MR means pull request or merge request. They tell others about changes you've pushed to a branch in a repository. They are essentially a request to merge one branch into another."
  ],
  "mr": [
    "PR/MR means pull request or merge request. They tell others about changes you've pushed to a branch in a repository. They are essentially a request to merge one branch into another."
  ],
  "swe": [
    "SWE is an acronym for software engineer, a profession where people code and write software."
  ],
  "em": [
    "EM is an acronym for engineering manager. Engineering manager (management) is one of the two tracks for software engineering career, the other being the individual contributor track."
  ],
  "pip": [
    "In tech companies, PIP means performance improvement plan. The PIP program is for people whose performance did not meet expectations in a review cycle. If PIP goals are not met at the end of the program, the employee will usually be let go."
  ],
  "tfip": [
    "The Technology in Finance Immersion Programme (TFIP) is an industry Attach-and-Train Career Conversion Programme that aims to build up an industry pipeline of capabilities in key technology areas to meet the talent needs of the financial services sector.",
    "https://www.ibf.org.sg/home/for-individuals/skills-and-jobs-development/career-conversion/tfip"
  ]
}
